login = "fR3449 f@z83r"
food = "Что будете заказывать?(Введите цифру)\n"\
             "1>>>Пиццы\n"\
             "2>>>Суши/Роллы\n"\
             "3>>>Салаты\n"\
             "4>>>Супы\n"\
             "5>>>Напитки\n"\
             "6>>>Мороженое\n" \
       ":"


pizza = "Выберите пиццу (выбор осуществляется без : и цены)\n"\
      "1>>Маргарита: 400 руб\n"\
      "2>>Пеперони: 420 руб\n"\
      "3>>Карбонара большая: 500 руб\n"\
      "4>>Цыплёнок барбекю: 485 руб\n"\
      "5>>4 сыра: 450 руб\n" \
        ":"

soup = "Выберите суп (выбор осуществляется без : и цены)\n" \
       "1>>Том Ям: 480 руб\n" \
       "2>>Том Кха: 340 руб\n" \
       "3>>Луковый: 300 руб\n" \
       "4>>Сливочно лососевый: 390 руб\n" \
       ":"


pay = "Выберите оплату\n"\
      "1>>Наличные\n"\
      "2>>Безналичные\n" \
      ":"

question = "Ещё будете что-то заказывать?\n"\
                 "1>>Да\n"\
                 "2>>Нет\n" \
           ":"

sushi_rolls = "Выберите суши/роллы (выбор осуществляется без : и цены)\n" \
              "1>>Филадельфия: 280 руб\n" \
              "2>>Филадельия лайт с огурцом: 269 руб\n" \
              "3>>Калифорния: 279 руб\n" \
              "4>>Лава: 319 руб\n" \
              "5>>С тунцом: 339 руб\n" \
              "6>>В кляре: 299 руб\n" \
              "7>>Бостон: 339 руб\n" \
              ":"
# __________________________________________________________________________________________________________


# Все меню(функции)
# ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||


dictionary = {
    1: '1',
    '2': 2,
    3: '3',
}


def get_key(dictionary, value):
    for k, v in dictionary.items():
        if v == value:
            return k




food_list = ["1", "2", "3", "4", "5", "6", "7"]

food_count = {"Пиццы" : 1, "Суши/Роллы" : 2, "Салаты" : 3, "Супы" : 4, "Напитки" : 5, "Мороженое" : 6}
food_name = {"Пиццы" : pizza, "Суши/Роллы" : sushi_rolls}

pizza_count = {"Маргарита" : 1, "Пеперони" : 2, "Карбонара большая" : 3, "Цыплёнок барбекю" : 4, "4 сыра" : 5}
pizza_price = {"Маргарита" : 400, "Пеперони" : 420, "Карбонара большая" : 500, "Цыплёнок барбекю" : 450, "4 сыра" : 450}

sushi_count = {"Филадельфия" : 1, "Филадельия лайт с огурцом" : 2, "Калифорния" : 3, "Лава" : 4, "С тунцом" : 5, "В кляре" : 6, "Бостон" : 7}
sushi_price = {"Филадельфия" : 280, "Филадельия лайт с огурцом" : 269, "Калифорния" : 279, "Лава" : 319, "С тунцом" : 339, "В кляре" : 299, "Бостон" : 339}



soup_count = {"Том Ям" : 1, "Том Кха" : 2, "Луковый" : 3, "Сливочно лососевый" : 4}
soup_price = {"Том Ям" : 480, "Том Кха" : 340, "Луковый" : 300, "Сливочно лососевый" : 390}